Revit 2024 API
MEPNetworkSegmentData.GetUpstreamSegments Method
 Gets all upstream network segments.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IList<MEPNetworkSegmentId> GetUpstreamSegments()
Visual Basic
Public Function GetUpstreamSegments As IList(Of MEPNetworkSegmentId)
Visual C++
public:
IList<MEPNetworkSegmentId^>^ GetUpstreamSegments()
Return Value
 The list of segments that flow into this segment.
See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace